Ran Plan for 2 projects:

1. dir: `.` workspace: `stage`
1. dir: `.` workspace: `prod`

### 1. dir: `.` workspace: `stage`
<details><summary>Show Output</summary>

```diff
run plan


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
! update in-place

Terraform will perform the following actions:

  # local_file.atlantis will be created
+ resource "local_file" "atlantis" {
+       content              = <<-EOT
            apiVersion: apps/v1
            kind: StatefulSet
            metadata:
              name: atlantis
            spec:
              serviceName: atlantis
              replicas: 1
              updateStrategy:
                type: RollingUpdate
                rollingUpdate:
                  partition: 0
              selector:
                matchLabels:
                  app: atlantis
              template:
                metadata:
                  labels:
                    app: atlantis
                spec:
                  securityContext:
                    fsGroup: 1000 # Atlantis group (1000) read/write access to volumes.
            
                  initContainers:
                  - name: volume-mount-hack
                    image: busybox
                    command:
                      - sh
                      - "-c"
                      - |
                        chown -R 100:1000 /atlantis
                        cp -r /home/atlantis_temp/. /home/atlantis/
                        cp -r /home/atlantis_temp/. /root/
                        chown -R 100:1000 /home/atlantis/
                        chmod 600 /home/atlantis/.ssh/*
                        chmod 600 /root/.ssh/*
                    volumeMounts:
                    - name: atlantis-data
                      mountPath: /atlantis
                    - name: atlantis-home
                      mountPath: /home/atlantis
                    - name: atlantis-root
                      mountPath: /root
                    - name: ssh
                      mountPath: /home/atlantis_temp/.ssh/id_ed25519
                      subPath: id_ed25519
                    - name: ssh-pub
                      mountPath: /home/atlantis_temp/.ssh/id_ed25519.pub
                      subPath: id_ed25519.pub
                    - name: terraformrc
                      mountPath: /home/atlantis_temp/.terraformrc
                      subPath: .terraformrc
                    - name: auto-tfvars
                      mountPath: /home/atlantis_temp/.auto.tfvars
                      subPath: .auto.tfvars
                    - name: key-json
                      mountPath: /home/atlantis_temp/key.json
                      subPath: key.json
                    - name: server-config
                      mountPath: /home/atlantis_temp/server.yaml
                      subPath: server.yaml
            
                  containers:
                  - name: atlantis
                    image: ghcr.io/runatlantis/atlantis:v0.22.3
                    command: ["docker-entrypoint.sh"]
                    args:
                      - "server"
                      - "--atlantis-url=http://62.84.117.214:30141/"
                      - "--var-file-allowlist=/home/atlantis"
                      - "--tf-download-url=https://terraform-mirror.yandexcloud.net/"
                      - "--repo-config=/home/atlantis/server.yaml"
                      - "--enable-diff-markdown-format"
                      - "--allow-fork-prs"
                    env:
                    - name: ATLANTIS_REPO_ALLOWLIST
                      value: github.com/dmi3x3/netology_diplom
                    ### GitHub Config ###
                    - name: ATLANTIS_GH_USER
                      value: dmi3x3 #  If you're using GitHub replace <YOUR_GITHUB_USER> with the username of your Atlantis GitHub user without the `@`.
                    - name: ATLANTIS_GH_TOKEN
                      valueFrom:
                        secretKeyRef:
                          name: atlantis-vcs
                          key: token
                    - name: ATLANTIS_GH_WEBHOOK_SECRET
                      valueFrom:
                        secretKeyRef:
                          name: atlantis-vcs
                          key: webhook-secret
                    ### End GitHub Config ###
                    - name: ATLANTIS_DATA_DIR
                      value: /atlantis
                    - name: ATLANTIS_PORT
                      value: "4141" # Kubernetes sets an ATLANTIS_PORT variable so we need to override.
            
                    volumeMounts:
                    - name: atlantis-data
                      mountPath: /atlantis
                    - name: atlantis-home
                      mountPath: /home/atlantis
                    - name: atlantis-root
                      mountPath: /root
            
                    ports:
                    - name: atlantis
                      containerPort: 4141
            
                    resources:
                      requests:
                        memory: 256Mi
                        cpu: 100m
                      limits:
                        memory: 256Mi
                        cpu: 100m
            
                  volumes:
                  - name: atlantis-home
                    emptyDir: { }
                  - name: atlantis-root
                    emptyDir: { }
                  - name: atlantis-data
                    persistentVolumeClaim:
                      claimName: atlantis-data
                  - name: ssh
                    configMap:
                      name: atlantis-files
                      items:
                      - key: ssh
                        path: id_ed25519
                  - name: ssh-pub
                    configMap:
                      name: atlantis-files
                      items:
                      - key: ssh-pub
                        path: id_ed25519.pub
                  - name: terraformrc
                    configMap:
                      name: atlantis-files
                      items:
                      - key: terraformrc
                        path: .terraformrc
                  - name: auto-tfvars
                    configMap:
                      name: atlantis-files
                      items:
                      - key: auto-tfvars
                        path: .auto.tfvars
                  - name: key-json
                    configMap:
                      name: atlantis-files
                      items:
                      - key: key-json
                        path: key.json
                  - name: server-config
                    configMap:
                      name: atlantis-files
                      items:
                      - key: server-config
                        path: server.yaml
        EOT
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0777"
+       file_permission      = "0777"
+       filename             = "./atlantis/stage-statefulset.yaml"
+       id                   = (known after apply)
    }

  # local_file.inventory will be created
+ resource "local_file" "inventory" {
+       content              = <<-EOT
            [all]
            stage-node-0 ansible_host=62.84.117.214 ip=10.10.1.18 etcd_member_name=etcd0 ansible_user=ndiplom
            stage-node-1 ansible_host=158.160.3.57 ip=10.10.2.6  ansible_user=ndiplom
            stage-node-2 ansible_host=51.250.41.111 ip=10.10.3.27  ansible_user=ndiplom
            
            [kube_control_plane]
            stage-node-0
            
            [etcd]
            stage-node-0
            
            [kube_node]
            
            stage-node-1
            stage-node-2
            
            [calico_rr]
            
            [k8s_cluster:children]
            kube_control_plane
            kube_node
            calico_rr
            
            [kube_control_plane:vars]
            supplementary_addresses_in_ssl_keys = [ "62.84.117.214" ]
        EOT
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0777"
+       file_permission      = "0777"
+       filename             = "../../kubespray/inventory/netology-diplom-cluster/stage-inventory"
+       id                   = (known after apply)
    }

  # yandex_lb_network_load_balancer.k8s-lb will be updated in-place
! resource "yandex_lb_network_load_balancer" "k8s-lb" {
        id         = "enpofcscsj6hruv0msq5"
        name       = "stage-k8s-lb"
-       region_id  = "ru-central1" -> null
        # (4 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # yandex_lb_target_group.k8s_lb_tg will be updated in-place
! resource "yandex_lb_target_group" "k8s_lb_tg" {
        id         = "enp0iikoi4ggskibvb8u"
        name       = "stage-k8s-tg"
-       region_id  = "ru-central1" -> null
        # (3 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 2 to add, 2 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "secret_key" but a value
│ was found in file ".auto.tfvars". If you meant to use this value, add a
│ "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "access_key" but a value
│ was found in file ".auto.tfvars". If you meant to use this value, add a
│ "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -w stage`
* :put_litter_in_its_place: To **delete** this plan click [here](http://62.84.117.214:30141/lock?id=dmi3x3%252Fnetology_diplom%252F.%252Fstage)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -w stage`
</details>
Plan: 2 to add, 2 to change, 0 to destroy.

---
### 2. dir: `.` workspace: `prod`
<details><summary>Show Output</summary>

```diff
run plan


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # local_file.atlantis will be created
+ resource "local_file" "atlantis" {
+       content              = (known after apply)
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0777"
+       file_permission      = "0777"
+       filename             = "./atlantis/prod-statefulset.yaml"
+       id                   = (known after apply)
    }

  # local_file.inventory will be created
+ resource "local_file" "inventory" {
+       content              = (known after apply)
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0777"
+       file_permission      = "0777"
+       filename             = "../../kubespray/inventory/netology-diplom-cluster/prod-inventory"
+       id                   = (known after apply)
    }

  # null_resource.atlantis_apply will be created
+ resource "null_resource" "atlantis_apply" {
+       id = (known after apply)
    }

  # null_resource.atlantis_configmap will be created
+ resource "null_resource" "atlantis_configmap" {
+       id = (known after apply)
    }

  # null_resource.atlantis_secret will be created
+ resource "null_resource" "atlantis_secret" {
+       id = (known after apply)
    }

  # null_resource.helm_install_app-web will be created
+ resource "null_resource" "helm_install_app-web" {
+       id = (known after apply)
    }

  # null_resource.install_jenkins-crd will be created
+ resource "null_resource" "install_jenkins-crd" {
+       id = (known after apply)
    }

  # null_resource.jenkins-ns will be created
+ resource "null_resource" "jenkins-ns" {
+       id = (known after apply)
    }

  # null_resource.k8-cluster will be created
+ resource "null_resource" "k8-cluster" {
+       id = (known after apply)
    }

  # null_resource.kubectl-config will be created
+ resource "null_resource" "kubectl-config" {
+       id = (known after apply)
    }

  # null_resource.login-password4jenkins will be created
+ resource "null_resource" "login-password4jenkins" {
+       id = (known after apply)
    }

  # null_resource.monitoring will be created
+ resource "null_resource" "monitoring" {
+       id = (known after apply)
    }

  # null_resource.monitoring-setup will be created
+ resource "null_resource" "monitoring-setup" {
+       id = (known after apply)
    }

  # null_resource.monitoring-wait will be created
+ resource "null_resource" "monitoring-wait" {
+       id = (known after apply)
    }

  # null_resource.wait will be created
+ resource "null_resource" "wait" {
+       id = (known after apply)
    }

  # yandex_compute_instance.cluster-k8s[0] will be created
+ resource "yandex_compute_instance" "cluster-k8s" {
+       allow_stopping_for_update = true
+       created_at                = (known after apply)
+       folder_id                 = (known after apply)
+       fqdn                      = (known after apply)
+       hostname                  = "prod-node-0"
+       id                        = (known after apply)
+       labels                    = {
+           "index" = "0"
        }
+       metadata                  = {
+           "user-data" = <<-EOT
                #cloud-config
                users:
                  - name: ndiplom
                    groups: sudo
                    shell: /bin/bash
                    sudo: ['ALL=(ALL) NOPASSWD:ALL']
                    ssh-authorized-keys:
                      - ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIBNt8zob1cJ+VfXSAazo8l6WHCIgl+m+02iH88/F+vWk
            EOT
        }
+       name                      = "prod-node-0"
+       network_acceleration_type = "standard"
+       platform_id               = "standard-v3"
+       service_account_id        = (known after apply)
+       status                    = (known after apply)
+       zone                      = "ru-central1-a"

+       boot_disk {
+           auto_delete = true
+           device_name = (known after apply)
+           disk_id     = (known after apply)
+           mode        = (known after apply)

+           initialize_params {
+               block_size  = (known after apply)
+               description = (known after apply)
+               image_id    = "fd8nn6vae2u4vo18bv3s"
+               name        = (known after apply)
+               size        = 20
+               snapshot_id = (known after apply)
+               type        = "network-ssd"
            }
        }

+       metadata_options {
+           aws_v1_http_endpoint = (known after apply)
+           aws_v1_http_token    = (known after apply)
+           gce_http_endpoint    = (known after apply)
+           gce_http_token       = (known after apply)
        }

+       network_interface {
+           index              = (known after apply)
+           ip_address         = (known after apply)
+           ipv4               = true
+           ipv6               = (known after apply)
+           ipv6_address       = (known after apply)
+           mac_address        = (known after apply)
+           nat                = true
+           nat_ip_address     = (known after apply)
+           nat_ip_version     = (known after apply)
+           security_group_ids = (known after apply)
+           subnet_id          = (known after apply)
        }

+       placement_policy {
+           host_affinity_rules = (known after apply)
+           placement_group_id  = (known after apply)
        }

+       resources {
+           core_fraction = 100
+           cores         = 4
+           memory        = 12
        }

+       scheduling_policy {
+           preemptible = true
        }
    }

  # yandex_compute_instance.cluster-k8s[1] will be created
+ resource "yandex_compute_instance" "cluster-k8s" {
+       allow_stopping_for_update = true
+       created_at                = (known after apply)
+       folder_id                 = (known after apply)
+       fqdn                      = (known after apply)
+       hostname                  = "prod-node-1"
+       id                        = (known after apply)
+       labels                    = {
+           "index" = "1"
        }
+       metadata                  = {
+           "user-data" = <<-EOT
                #cloud-config
                users:
                  - name: ndiplom
                    groups: sudo
                    shell: /bin/bash
                    sudo: ['ALL=(ALL) NOPASSWD:ALL']
                    ssh-authorized-keys:
                      - ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIBNt8zob1cJ+VfXSAazo8l6WHCIgl+m+02iH88/F+vWk
            EOT
        }
+       name                      = "prod-node-1"
+       network_acceleration_type = "standard"
+       platform_id               = "standard-v3"
+       service_account_id        = (known after apply)
+       status                    = (known after apply)
+       zone                      = "ru-central1-b"

+       boot_disk {
+           auto_delete = true
+           device_name = (known after apply)
+           disk_id     = (known after apply)
+           mode        = (known after apply)

+           initialize_params {
+               block_size  = (known after apply)
+               description = (known after apply)
+               image_id    = "fd8nn6vae2u4vo18bv3s"
+               name        = (known after apply)
+               size        = 20
+               snapshot_id = (known after apply)
+               type        = "network-ssd"
            }
        }

+       metadata_options {
+           aws_v1_http_endpoint = (known after apply)
+           aws_v1_http_token    = (known after apply)
+           gce_http_endpoint    = (known after apply)
+           gce_http_token       = (known after apply)
        }

+       network_interface {
+           index              = (known after apply)
+           ip_address         = (known after apply)
+           ipv4               = true
+           ipv6               = (known after apply)
+           ipv6_address       = (known after apply)
+           mac_address        = (known after apply)
+           nat                = true
+           nat_ip_address     = (known after apply)
+           nat_ip_version     = (known after apply)
+           security_group_ids = (known after apply)
+           subnet_id          = (known after apply)
        }

+       placement_policy {
+           host_affinity_rules = (known after apply)
+           placement_group_id  = (known after apply)
        }

+       resources {
+           core_fraction = 100
+           cores         = 4
+           memory        = 12
        }

+       scheduling_policy {
+           preemptible = true
        }
    }

  # yandex_compute_instance.cluster-k8s[2] will be created
+ resource "yandex_compute_instance" "cluster-k8s" {
+       allow_stopping_for_update = true
+       created_at                = (known after apply)
+       folder_id                 = (known after apply)
+       fqdn                      = (known after apply)
+       hostname                  = "prod-node-2"
+       id                        = (known after apply)
+       labels                    = {
+           "index" = "2"
        }
+       metadata                  = {
+           "user-data" = <<-EOT
                #cloud-config
                users:
                  - name: ndiplom
                    groups: sudo
                    shell: /bin/bash
                    sudo: ['ALL=(ALL) NOPASSWD:ALL']
                    ssh-authorized-keys:
                      - ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIBNt8zob1cJ+VfXSAazo8l6WHCIgl+m+02iH88/F+vWk
            EOT
        }
+       name                      = "prod-node-2"
+       network_acceleration_type = "standard"
+       platform_id               = "standard-v3"
+       service_account_id        = (known after apply)
+       status                    = (known after apply)
+       zone                      = "ru-central1-c"

+       boot_disk {
+           auto_delete = true
+           device_name = (known after apply)
+           disk_id     = (known after apply)
+           mode        = (known after apply)

+           initialize_params {
+               block_size  = (known after apply)
+               description = (known after apply)
+               image_id    = "fd8nn6vae2u4vo18bv3s"
+               name        = (known after apply)
+               size        = 20
+               snapshot_id = (known after apply)
+               type        = "network-ssd"
            }
        }

+       metadata_options {
+           aws_v1_http_endpoint = (known after apply)
+           aws_v1_http_token    = (known after apply)
+           gce_http_endpoint    = (known after apply)
+           gce_http_token       = (known after apply)
        }

+       network_interface {
+           index              = (known after apply)
+           ip_address         = (known after apply)
+           ipv4               = true
+           ipv6               = (known after apply)
+           ipv6_address       = (known after apply)
+           mac_address        = (known after apply)
+           nat                = true
+           nat_ip_address     = (known after apply)
+           nat_ip_version     = (known after apply)
+           security_group_ids = (known after apply)
+           subnet_id          = (known after apply)
        }

+       placement_policy {
+           host_affinity_rules = (known after apply)
+           placement_group_id  = (known after apply)
        }

+       resources {
+           core_fraction = 100
+           cores         = 4
+           memory        = 12
        }

+       scheduling_policy {
+           preemptible = true
        }
    }

  # yandex_lb_network_load_balancer.k8s-lb will be created
+ resource "yandex_lb_network_load_balancer" "k8s-lb" {
+       created_at = (known after apply)
+       folder_id  = (known after apply)
+       id         = (known after apply)
+       name       = "prod-k8s-lb"
+       type       = "external"

+       attached_target_group {
+           target_group_id = (known after apply)

+           healthcheck {
+               healthy_threshold   = 2
+               interval            = 2
+               name                = "http"
+               timeout             = 1
+               unhealthy_threshold = 2

+               http_options {
+                   path = "/login"
+                   port = 30030
                }
            }
        }

+       listener {
+           name        = "app-listener"
+           port        = 80
+           protocol    = (known after apply)
+           target_port = 30080

+           external_address_spec {
+               address    = (known after apply)
+               ip_version = "ipv4"
            }
        }
+       listener {
+           name        = "grafana-listener"
+           port        = 3000
+           protocol    = (known after apply)
+           target_port = 30030

+           external_address_spec {
+               address    = (known after apply)
+               ip_version = "ipv4"
            }
        }
+       listener {
+           name        = "j-instance-listener"
+           port        = 8080
+           protocol    = (known after apply)
+           target_port = 30808

+           external_address_spec {
+               address    = (known after apply)
+               ip_version = "ipv4"
            }
        }
    }

  # yandex_lb_target_group.k8s_lb_tg will be created
+ resource "yandex_lb_target_group" "k8s_lb_tg" {
+       created_at = (known after apply)
+       folder_id  = (known after apply)
+       id         = (known after apply)
+       name       = "prod-k8s-tg"

+       target {
+           address   = (known after apply)
+           subnet_id = (known after apply)
        }
+       target {
+           address   = (known after apply)
+           subnet_id = (known after apply)
        }
+       target {
+           address   = (known after apply)
+           subnet_id = (known after apply)
        }
    }

  # yandex_vpc_network.netology-diplom will be created
+ resource "yandex_vpc_network" "netology-diplom" {
+       created_at                = (known after apply)
+       default_security_group_id = (known after apply)
+       folder_id                 = (known after apply)
+       id                        = (known after apply)
+       labels                    = (known after apply)
+       name                      = "prod-netology-diplom"
+       subnet_ids                = (known after apply)
    }

  # yandex_vpc_subnet.subnet-zones[0] will be created
+ resource "yandex_vpc_subnet" "subnet-zones" {
+       created_at     = (known after apply)
+       folder_id      = (known after apply)
+       id             = (known after apply)
+       labels         = (known after apply)
+       name           = "prod-subnet-ru-central1-a"
+       network_id     = (known after apply)
+       v4_cidr_blocks = [
+           "10.10.11.0/24",
        ]
+       v6_cidr_blocks = (known after apply)
+       zone           = "ru-central1-a"
    }

  # yandex_vpc_subnet.subnet-zones[1] will be created
+ resource "yandex_vpc_subnet" "subnet-zones" {
+       created_at     = (known after apply)
+       folder_id      = (known after apply)
+       id             = (known after apply)
+       labels         = (known after apply)
+       name           = "prod-subnet-ru-central1-b"
+       network_id     = (known after apply)
+       v4_cidr_blocks = [
+           "10.10.22.0/24",
        ]
+       v6_cidr_blocks = (known after apply)
+       zone           = "ru-central1-b"
    }

  # yandex_vpc_subnet.subnet-zones[2] will be created
+ resource "yandex_vpc_subnet" "subnet-zones" {
+       created_at     = (known after apply)
+       folder_id      = (known after apply)
+       id             = (known after apply)
+       labels         = (known after apply)
+       name           = "prod-subnet-ru-central1-c"
+       network_id     = (known after apply)
+       v4_cidr_blocks = [
+           "10.10.33.0/24",
        ]
+       v6_cidr_blocks = (known after apply)
+       zone           = "ru-central1-c"
    }

Plan: 24 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ external_ip_address_nodes = {
+       prod-node-0 = (known after apply)
+       prod-node-1 = (known after apply)
+       prod-node-2 = (known after apply)
    }
+ external_load_balancer_ip = (known after apply)
+ internal_ip_address_nodes = {
+       prod-node-0 = (known after apply)
+       prod-node-1 = (known after apply)
+       prod-node-2 = (known after apply)
    }
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "access_key" but a value
│ was found in file ".auto.tfvars". If you meant to use this value, add a
│ "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "secret_key" but a value
│ was found in file ".auto.tfvars". If you meant to use this value, add a
│ "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -w prod`
* :put_litter_in_its_place: To **delete** this plan click [here](http://62.84.117.214:30141/lock?id=dmi3x3%252Fnetology_diplom%252F.%252Fprod)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -w prod`
</details>
Plan: 24 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`